In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame(np.random.randint(1,10,(4,3)))

In [3]:
df

   0  1  2
0  1  9  5
1  6  1  6
2  6  8  2
3  4  2  3

In [5]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [6]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
df.values

array([[1, 9, 5],
       [6, 1, 6],
       [6, 8, 2],
       [4, 2, 3]])

In [10]:
df.ndim

2

In [11]:
df.shape

(4, 3)

In [14]:
df[1]

0    9
1    1
2    8
3    2
Name: 1, dtype: int32

In [15]:
df

   0  1  2
0  1  9  5
1  6  1  6
2  6  8  2
3  4  2  3

In [13]:
df.loc[0]

0    1
1    9
2    5
Name: 0, dtype: int32

In [16]:
df.loc[3]

0    4
1    2
2    3
Name: 3, dtype: int32

In [17]:
df.iloc[:,:1]

   0
0  1
1  6
2  6
3  4

In [18]:
df

   0  1  2
0  1  9  5
1  6  1  6
2  6  8  2
3  4  2  3

In [20]:
df.iloc[2:,:2]

   0  1
2  6  8
3  4  2

In [26]:
area = pd.Series({'California': 423967, 
'New York': 141297, 'Florida': 170312,
'Illinois': 149995})

In [23]:
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127, 'Florida': 19552860,
'Illinois': 12882135})

In [27]:
data=pd.DataFrame({'area':area,'pop':pop})

In [28]:
data

                area       pop
California  423967.0  38332521
Florida     170312.0  19552860
Illinois    149995.0  12882135
New York    141297.0  19651127
Texas            NaN  26448193

In [35]:
data.iloc[4,0]=500

In [36]:
data

                area       pop
California  423967.0  38332521
Florida     170312.0  19552860
Illinois    149995.0  12882135
New York    141297.0  19651127
Texas          500.0  26448193

In [37]:
data['area']

California    423967.0
Florida       170312.0
Illinois      149995.0
New York      141297.0
Texas            500.0
Name: area, dtype: float64

In [38]:
data.area

California    423967.0
Florida       170312.0
Illinois      149995.0
New York      141297.0
Texas            500.0
Name: area, dtype: float64

In [40]:
data['Density']=data['pop']/data['area']

In [41]:
data

                area       pop       Density
California  423967.0  38332521     90.413926
Florida     170312.0  19552860    114.806121
Illinois    149995.0  12882135     85.883763
New York    141297.0  19651127    139.076746
Texas          500.0  26448193  52896.386000